app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    begin
      @cart = Cart.find(params[:id])

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @cart = Cart.find(params[:id])

INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Wed, 07 Aug 2013 15:22:57 UTC +00:00], ["updated_at", Wed, 07 Aug 2013 15:22:57 UTC +00:00]]
---
  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @cart = Cart.find(params[:id])

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190962]]
---
  def destroy
    @cart = current_cart
    @cart.destroy