app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate page: params[:page], order: 'created_at desc', per_page: 10
---
SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def new
    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 980190963

  def edit
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Wed, 07 Aug 2013 15:22:59 UTC +00:00], ["updated_at", Wed, 07 Aug 2013 15:22:59 UTC +00:00]]
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "pay_type_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 980190963]]

  def update
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 980190962]]